Repository: JuniorPolegato/pole
Catalog: po/locale/*/LC_MESSAGES/pole.po
Languages: pt_br

source: and
pt_br: e

source: or
pt_br: ou

source: not\s*in
pt_br: não\s*em

source: is\s*not\s*null
pt_br: não\s*é\s*nulo

source: is\s*not
pt_br: não\s*é

source: is\s*null
pt_br: é\s*nulo

source: not\s*like
pt_br: não\s*contém

source: not\s*between
pt_br: não\s*entre

source: will\s*be
pt_br: será

source: will\s*not\s*be
pt_br: não\s*será

source: was\s*not
pt_br: não\s*foi

source: was
pt_br: foi

source: in
pt_br: em

source: is
pt_br: é

source: like
pt_br: contém

source: between
pt_br: entre

source: this\s*month
pt_br: este\s*mês

source: next\s*month
pt_br: próximo\s*mês

source: last\s*month
pt_br: mês\s*passado

source: this\s*year
pt_br: este\s*ano

source: next\s*year
pt_br: próximo\s*ano

source: last\s*year
pt_br: ano\s*passado

source: this\s*week
pt_br: esta\s*semana

source: next\s*week
pt_br: próxima\s*semana

source: last\s*week
pt_br: semana\s*passada

source: yesterday
pt_br: ontem

source: today
pt_br: hoje

source: tomorrow
pt_br: amanhã

source: now
pt_br: agora

source: Information
pt_br: Informação

source: Warning
pt_br: Aviso

source: Question
pt_br: Questão

source: Error
pt_br: Erro

source: Give the resquested information
pt_br: Forneça a informação solicitada

source: Details
pt_br: Detalhes

source: Select folder
pt_br: Selecione uma pasta

source: Select file to save to
pt_br: Selecione o arquivo para salvar

source: Select file
pt_br: Selecione um arquivo

source: Overwrite the file?
pt_br: Sobrescrever o arquivo?

source: _Now
pt_br: _Agora

source: _Today
pt_br: _Hoje

source: Year:
pt_br: Ano:

source: Time:
pt_br: Horário:

source: Invalid or not found column name `%s´.
pt_br: Nome de coluna `%s´ inválido ou não encontrado.

source: This value could not be converted or formatted. This value is ignored and the previous value will not change.
pt_br: Alguns valores não puderam ser convertidos nem formatados! Eles serão mostrados como são e avaliados para zero (0 ou 0,00) ou falso.

source: Invalid type of column index or name `´.
pt_br: Tipo de coluna ou nome `´ inválido.

source: Invalid type `%s´. Expected int, long, bool, float, str, datetime, date, time, month or hours.
pt_br: Argumento "conteúdo" do tipo `%s´ é inválido. Esperado int, bool, float, str, date, time ou datetime.

source: Expected just one `edit´ for editable.
pt_br: Esperado apenas um `edit´ para editável.

source: Invalid value for editable `%s´. Expected `edit´ for editable, just one.
pt_br: O valor `%s´ é inválido para coluna editável. Esperado `edit´ para tornar uma coluna editável.

source: No columns structure defined.
pt_br: Estrutura de colunas não definida.

source: Path or iter is not valid for this model.
pt_br: O caminho "path/iter" não é válido para este modelo.

source: Error!
pt_br: Erro!

source: Some values could not be converted or formatted! They will be displayed as they are and evalueted by zero (0 ou 0.0) or false.
pt_br: Alguns valores não puderam ser convertidos nem formatados! Eles serão mostrados como são e avaliados para zero (0 ou 0,00) ou falso.

source: Path or iter is not valid.
pt_br: O caminho "path/iter" não é válido.

source: Please wait...
pt_br: Por favor aguarde...

source: Getting lines...
pt_br: Obtendo linhas...

source: Loading lines...
pt_br: Carregando linhas...

source: Invalid or not found column name `´.
pt_br: Nome de coluna `´ inválido ou não encontrado.

source: Invalid or not found column name or number `´.
pt_br: Nome ou número de coluna `´ inválido ou não encontrado.

source: Y
pt_br: S

source: Filter help
pt_br: Ajuda com o filtro

source: The filter must be in the format: {{column}}|field|expression operator value [junction {{column}}|field|expression operator value ...] Operators: {signs} {ops} Junctions: {joins} Date keywords: {dates} Examples: {{Code}} < 100 and {{Description}} = "CABO*AC*5?MM*" {{Description}} = null {{Date}} is not null length({{Description}}) < 5 substr({{Date}}, 4, 4) = '2018' to_number(substr({{Date}}, 4, 4)) <= 2017 {{Date}} is today {{Date}} was yesterday trunc({{Date}}) = '18/04/2019' See SQL expressions in: http://pgdocptbr.sourceforge.net/pg80/functions.html
pt_br: O filtro precisa estar no formato: {{coluna}}|campo|expressão operador valor [junção {{coluna}}|campo|expressão operador valor ...] Operadores: {signs} {ops} Junções: {joins} Palavras-chaves para datas: {dates} Exemplos: {{Código}} < 100 e {{Descrição}} = "CABO*AC*5?MM*" {{Descrição}} = nulo {{Data}} não é nulo length({{Descrição}}) < 5 substr({{Data}}, 4, 4) = '2018' to_number(substr({{Data}}, 4, 4)) <= 2017 {{Data}} é hoje {{Data}} foi ontem trunc({{Date}}) = '18/04/2019' Consulte expressões SQL em: http://pgdocptbr.sourceforge.net/pg80/functions.html

source: Filter mistake!
pt_br: Problemas no filtro!

source: String mistake! %s at %i.
pt_br: Problema no texto! %s em %i.

source: Left side mistake!
pt_br: Problema no lado esquerdo!

source: Between operator fail!
pt_br: Operador "entre" com problemas!

source: Right side mistake!
pt_br: Problema no lado direito!

source: null
pt_br: nulo

source: Do you really want %s?
pt_br: Você quer realmente %s?

source: to update
pt_br: atualizar

source: to delete
pt_br: deletar

source: No lines found for %s!
pt_br: Nenhuma linha encontrada para %s!

source: to
pt_br: para

source: Do you want %s %s line(s)?
pt_br: Você quer %s %s linha(s)?

source: Field:
pt_br: Campo:

source: Empty
pt_br: Vazio

source: Default
pt_br: Padrão

source: Field
pt_br: Campo

source: Value
pt_br: Valor

source: Restore original data for %s?
pt_br: Restaurar dados originais de %s?

source: Error: Parent project has no window.
pt_br: Erro: Projeto pai não possui janela.

source: Error: Module has no window.
pt_br: Erro: Módulo não possui janela.

source: Invalid argument "xml_file_or_xml_string" of type `%s´. Expected str.
pt_br: Argumento "xml_file_or_xml_string" inválido do tipo `%s´. Esperado str.

source: Invalid content. Expected XML data.
pt_br: Conteúdo inválido. Esperado dados em XML.

source: Data copied to memory!
pt_br: Dados copiados para memória!

source: True
pt_br: Verdadeiro

source: Yes
pt_br: Sim

source: T
pt_br: V

source: False
pt_br: Falso

source: No
pt_br: Não

source: Invalid argument "content" of type `%s´. Expected int, long, bool, float, str, date, time or datetime.
pt_br: Argumento "conteúdo" do tipo `%s´ é inválido. Esperado int, bool, float, str, date, time ou datetime.

source: Invalid argument "return_type" like a value. Expected int, long, bool, float, str, date, time or datetime.
pt_br: Argumento "tipo_retorno" como valor é inválido. Esperado int, bool, float, str, date, time ou datetime.

source: Invalid argument "return_type" of type `%s´. Expected int, long, bool, float, str, date, time or datetime.
pt_br: Argumento "tipo_retorno" do tipo `%s´ é inválido. Esperado int, bool, float, str, date, time ou datetime.

source: Invalid argument "decimals" of type `%s´. Expected int.
pt_br: Argumento "decimais" do tipo `%s´ é inválido. Esperado int.

source: Invalid argument "bool_formated" of type `%s´. Expected tuple or list.
pt_br: Argumento "formatos_boleanos" do tipo `%s´ é inválido. Esperado tupla ou lista.

source: Invalid argument "bool_formated" specification `%s´. Expected a tuple or list within 2 strings.
pt_br: Argumento "formatos_boleanos" especificado por `%s´ é inválido. Esperado tupla ou lista com 2 strings.

source: Invalid argument "bool_strings" of type `%s´. Expected tuple or list.
pt_br: Argumento "strings_boleanas" do tipo `%s´ é inválido. Esperado tupla ou lista.

source: Invalid argument "bool_strings" specification `%s´. Expected a tuple or list within 2 tuples or lists.
pt_br: Argumento "formatos_boleanos" especificado por `%s´ é inválido. Esperado tupla ou lista com 2 strings.

source: Invalid argument "bool_strings" specification `%s´. Expected a tuple or list within 2 tuples or lists of strings.
pt_br: Argumento "formatos_boleanos" especificado por `%s´ é inválido. Esperado tupla ou lista com 2 strings.

source: Invalid return_type of type `date´ when `time´ content was specified.
pt_br: Tipo de retorno `date´ inválido quando um conteúdo `time´ foi especificado.

source: It is not possible get printers from %s plataform or operating system.
pt_br: Não é possível listar impressoras na plataforma %s ou sistema operacional.
